app/controllers/companies_controller.rb

INSERT INTO "companies" ("address_line_1", "address_line_2", "city", "company_name", "created_at", "phone_1", "phone_2", "phone_tag_1", "phone_tag_2", "state", "updated_at", "website", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "users" ("profile_id", "profile_type") VALUES ($1, $2) RETURNING "id"  [["profile_id", 3], ["profile_type", "Company"]]
---
  def create
    @company = User.create! {|u| u.profile = Company.create(company_params)}

UPDATE "companies" SET "address_line_1" = $1, "address_line_2" = $2, "city" = $3, "company_name" = $4, "phone_1" = $5, "phone_2" = $6, "phone_tag_1" = $7, "phone_tag_2" = $8, "state" = $9, "updated_at" = $10, "website" = $11, "zipcode" = $12 WHERE "companies"."id" = 4
---
  def update
    respond_to do |format|
      if @company.update(company_params)

DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 1]]
---
  def destroy
    @company.destroy