app/controllers/contacts_controller.rb

SELECT "companies".* FROM "companies"
SELECT "users".* FROM "users"
---
  def index
    @companies = Company.all
    @users = User.all

INSERT INTO "companies" ("address_line_1", "address_line_2", "city", "company_name", "created_at", "phone_1", "phone_2", "phone_tag_1", "phone_tag_2", "state", "updated_at", "user_id", "website", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save

UPDATE "companies" SET "phone_1" = $1, "phone_tag_1" = $2, "phone_tag_2" = $3, "updated_at" = $4 WHERE "companies"."id" = 7  [["phone_1", "123"], ["phone_tag_1", "Cell"], ["phone_tag_2", "Cell"], ["updated_at", "2014-10-19 19:03:11.549130"]]
---
  def update
    respond_to do |format|
      if @company.update(company_params)