app/controllers/contacts_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      @user = ContactService.create(@user, current_user)
---
INSERT INTO "users" ("created_at", "type", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-19 19:06:34.782014"], ["type", "PersonUser"], ["updated_at", "2014-10-19 19:06:34.782014"]]

  def destroy
    ContactService.destroy(@user, current_user)
---
DELETE FROM "users" WHERE "users"."type" IN ('PersonUser') AND "users"."id" = $1  [["id", 18]]

  def set_contact
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 16]]