app/controllers/people_controller.rb

INSERT INTO "users" ("profile_id", "profile_type") VALUES ($1, $2) RETURNING "id"  [["profile_id", 1], ["profile_type", "Person"]]
---
  def create
    @person = User.create! {|u| u.profile = Person.create(person_params)}