app/controllers/relationships_controller.rb

SELECT "relationships".* FROM "relationships"  WHERE "relationships"."user_id" = $1  [["user_id", 16]]
---
  def index
    @relationships = @user.relationships.all

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 17]]
---
  def set_contact
    @user = User.find(params[:contact_id])

SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."user_id" = $1 AND "relationships"."id" = $2 LIMIT 1  [["user_id", 17], ["id", 1]]
---
  def set_relationship
    @relationship = @user.relationships.find(params[:id])