app/controllers/users_controller.rb

INSERT INTO "users" ("address_line_1", "address_line_2", "city", "created_at", "email", "first_name", "last_name", "phone_tag_1", "phone_tag_2", "state", "updated_at", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "phone_1" = $1, "phone_tag_1" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["phone_1", 555], ["phone_tag_1", "Cell"], ["updated_at", "2014-10-07 02:00:58.083548"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)